snlkuharlocal/src/Documents/РасчетЦен/РасчетЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетЦен</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрайсов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрайсов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрайсыСозданы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИндексСтрокиТаблицыЦен</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазоваяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коллекция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяКонтрольНоменклатуры</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыЦен</name>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаРасчета</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойПрайсЛист</name>
      <type>
        <types>DocumentRef.ПрайсЛист</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Прайс</name>
    <type>
      <types>DocumentRef.ПрайсЛист</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ПрайсЛист/ПрайсЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрайсЛист</name>
  <basedOn>Document.ЗаявкаНаУстановкуЦен</basedOn>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <comment>Дата окончания действия прайса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаявкаНаУстановкуЦен</types>
      <types>DocumentRef.РасчетЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/РасчетЦен/ManagerModule.bsl
Функция СоздатьПрайсы(ДокументСсылка) Экспорт
	
	НачатьТранзакцию();
	
	Для Каждого Стр Из ДокументСсылка.ТипыЦен Цикл
		// +++ { [14.06.2022]
		//Прайс = СоздатьДокументПрайсЛист(ДокументСсылка, Стр.ТипЦен);
		Если Стр.ОсновнойПрайсЛист.Пустая() Тогда
			Прайс = СоздатьДокументПрайсЛист(ДокументСсылка, Стр.ТипЦен);
		Иначе	
			Прайс = ИзменитьДокументПрайсЛист(ДокументСсылка, Стр.ТипЦен,Стр.ОсновнойПрайсЛист);
		КонецЕсли;
		// } +++ [14.06.2022]
		Если Прайс = Неопределено Тогда
			ОтменитьТранзакцию();
			Возврат Ложь;
		иначе
			СообщитьИзМодуля(""+Прайс);
		КонецЕсли;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

Функция СоздатьДокументПрайсЛист(ДокументСсылка, ТипЦен)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетЦенТовары.НомерСтроки КАК НомерСтроки,
	|	РасчетЦенТовары.Номенклатура КАК Номенклатура,
	|	РасчетЦенТовары.ТипЦен КАК ТипЦен,
	|	РасчетЦенТовары.Цена КАК Цена
	|ИЗ
	|	Документ.РасчетЦен.Товары КАК РасчетЦенТовары
	|ГДЕ
	|	РасчетЦенТовары.Ссылка = &ДокументСсылка
	|	И РасчетЦенТовары.ТипЦен = &ТипЦен
	// Кухарь А.Ю.  21.06.2022 начало
	//Пустые цены не пишем
		|	И РасчетЦенТовары.Цена <> 0
	// Кухарь А.Ю.  21.06.2022 конец	
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ПрайсОбъект = Документы.ПрайсЛист.СоздатьДокумент();
	ПрайсОбъект.Дата = ?(ЗначениеЗаполнено(ДокументСсылка.ДатаНачалаПрайсов), ДокументСсылка.ДатаНачалаПрайсов, НачалоДня(ТекущаяДата()));
	ПрайсОбъект.Дата2 = ?(ЗначениеЗаполнено(ДокументСсылка.ДатаОкончанияПрайсов), ДокументСсылка.ДатаОкончанияПрайсов, КонецГода(ТекущаяДата() + 31536000));
	
	ПрайсОбъект.Автор = ПараметрыСеанса.Пользователь;
	ПрайсОбъект.ДокОснование = ДокументСсылка;
	ПрайсОбъект.Комментарий = ДокументСсылка.Комментарий;
	
	ПрайсОбъект.ТипЦен = ТипЦен;
	
	ПрайсОбъект.Организация = Справочники.Организации.НайтиПоКоду("SS-001");
    ПрайсОбъект.ИБ = Справочники.ИБ.НайтиПоКоду("SSP");
	
	ПрайсОбъект.Валюта = ТипЦен.Валюта;
	ПрайсОбъект.Курс = ПолучитьКурсВалюты_ПоРусски(ПрайсОбъект.Валюта, ТекущаяДата());

	Попытка
		ПрайсОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Товары = Запрос.Выполнить().Выгрузить();
	
	Набор = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	Набор.Отбор.Прайс.Установить(ПрайсОбъект.Ссылка);
	
	Для Каждого СтрокаТовары ИЗ Товары Цикл
		НоваяЗапись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТовары);
		НоваяЗапись.Период = ПрайсОбъект.Дата;
		НоваяЗапись.Прайс = ПрайсОбъект.Ссылка;
		НоваяЗапись.УровеньДоступа = ТипЦен.УровеньДоступа;
		
		Уровень = СтрокаТовары.Номенклатура.Уровень();
		Если Уровень = 0 Тогда
			НоваяЗапись.ТипТовара = НоваяЗапись.Номенклатура;                                    
		ИначеЕсли Уровень = 1 Тогда
			НоваяЗапись.ТипТовара = НоваяЗапись.Номенклатура.Родитель;                                             
			НоваяЗапись.Брэнд = НоваяЗапись.Номенклатура;                                           
		ИначеЕсли Уровень = 2 Тогда
			НоваяЗапись.ТипТовара = НоваяЗапись.Номенклатура.Родитель.Родитель;
			НоваяЗапись.Брэнд = НоваяЗапись.Номенклатура.Родитель;
			НоваяЗапись.Модель = НоваяЗапись.Номенклатура;
		//крохин начало 31.01.2022	
	    //ИначеЕсли Уровень = 3 Тогда
		ИначеЕсли Уровень >= 3 Тогда
		//крохин конец 31.01.2022
			НоваяЗапись.ТипТовара = НоваяЗапись.Номенклатура.Родитель.Родитель.Родитель;
			НоваяЗапись.Брэнд = НоваяЗапись.Номенклатура.Родитель.Родитель;
			НоваяЗапись.Модель = НоваяЗапись.Номенклатура.Родитель;                      
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		Набор.Записать(Истина);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ПрайсОбъект.Ссылка;
	
КонецФункции
// +++ {Кузнецов Сергей Владимирович [14.06.2022]
Функция ИзменитьДокументПрайсЛист(ДокументСсылка, ТипЦен, ПрайсЛист)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетЦенТовары.НомерСтроки КАК НомерСтроки,
	|	РасчетЦенТовары.Номенклатура КАК Номенклатура,
	|	РасчетЦенТовары.ТипЦен КАК ТипЦен,
	|	РасчетЦенТовары.Цена КАК Цена
	|ИЗ
	|	Документ.РасчетЦен.Товары КАК РасчетЦенТовары
	|ГДЕ
	|	РасчетЦенТовары.Ссылка = &ДокументСсылка
	|	И РасчетЦенТовары.ТипЦен = &ТипЦен
	// Кухарь А.Ю.  21.06.2022 начало
	//Пустые цены не пишем
	|	И РасчетЦенТовары.Цена <> 0
	// Кухарь А.Ю.  21.06.2022 конец		
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Если ПрайсЛист.ДокОснование <> ДокументСсылка Тогда
		ПрайсОбъект = ПрайсЛист.ПолучитьОбъект();
		ПрайсОбъект.ДокОснование = ДокументСсылка;
		Попытка
			ПрайсОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	Товары = Запрос.Выполнить().Выгрузить();
	
	Набор = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	
	Для Каждого СтрокаТовары ИЗ Товары Цикл
		Набор.Отбор.Прайс.Установить(ПрайсЛист);
		Набор.Отбор.ТипЦен.Установить(СтрокаТовары.ТипЦен);
		Набор.Отбор.Номенклатура.Установить(СтрокаТовары.Номенклатура);
		Набор.Прочитать();
		Если Набор.Количество()=0 Тогда
			НоваяЗапись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТовары);
			НоваяЗапись.Период = ПрайсЛист.Дата;
			НоваяЗапись.Прайс = ПрайсЛист;
			НоваяЗапись.УровеньДоступа = ТипЦен.УровеньДоступа;
			
			Уровень = СтрокаТовары.Номенклатура.Уровень();
			Если Уровень = 0 Тогда
				НоваяЗапись.ТипТовара = НоваяЗапись.Номенклатура;                                    
			ИначеЕсли Уровень = 1 Тогда
				НоваяЗапись.ТипТовара = НоваяЗапись.Номенклатура.Родитель;                                             
				НоваяЗапись.Брэнд = НоваяЗапись.Номенклатура;                                           
			ИначеЕсли Уровень = 2 Тогда
				НоваяЗапись.ТипТовара = НоваяЗапись.Номенклатура.Родитель.Родитель;
				НоваяЗапись.Брэнд = НоваяЗапись.Номенклатура.Родитель;
				НоваяЗапись.Модель = НоваяЗапись.Номенклатура;
			ИначеЕсли Уровень = 3 Тогда
				НоваяЗапись.ТипТовара = НоваяЗапись.Номенклатура.Родитель.Родитель.Родитель;
				НоваяЗапись.Брэнд = НоваяЗапись.Номенклатура.Родитель.Родитель;
				НоваяЗапись.Модель = НоваяЗапись.Номенклатура.Родитель;                      
			КонецЕсли;
		Иначе
			Для Каждого Запись ИЗ Набор Цикл
				Запись.Цена = СтрокаТовары.Цена;
				Запись.Период = ПрайсЛист.Дата;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		Набор.Записать(Истина);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ПрайсЛист;
	
КонецФункции
// }Кузнецов Сергей Владимирович +++ [14.06.2022]

//////////////////// НАПЕЧАТАТЬ ДОКУМЕНТ //////////////////////////////////

Функция ПечатьДокумента(ДокументСсылка, ЗаголовокОтчета = "Товары", Макет = Неопределено) Экспорт
	
	Если Макет <> Неопределено Тогда
		СхемаКомпоновкиДанных = Макет;	
	Иначе
		СхемаКомпоновкиДанных = ПолучитьМакет("Макет");
	КонецЕсли;
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	ЭлементПараметраДанных = Настройки.ПараметрыДанных.Элементы.Найти("Ссылка");
	
	Если ЭлементПараметраДанных = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭлементПараметраДанных.Значение = ДокументСсылка;
	ЭлементПараметраДанных.Использование = Истина;
	
	ЗначениеПараметра = Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title"));

	ЗначениеПараметра.Значение = Строка(ДокументСсылка);
	ЗначениеПараметра.Использование = Истина;

	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровки	= Новый ДанныеРасшифровкиКомпоновкиДанных;	
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	АдресРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, Новый УникальныйИдентификатор);
	
	ЗаполнениеДокументов.НапечататьТабличныйДокумент(ДокументРезультат,,,ЗаголовокОтчета, , ,АдресРасшифровки);
	
КонецФункции
